#pragma once

#include <bitset>

#include "../Utils/HMath.h"
#include "../Utils/Utils.h"
#include "BlockLegacy.h"
#include "Dimension.h"
#include "EntityList.h"
#include "Inventory.h"
#include "InventoryTransaction.h"
#include "TextHolder.h"
#include "Components.h"

class GameMode;

class Level {
private:
	char pad_0x0[0xBF0];  // 0x0
public:
	int rayHitType;  // 0xBF0
	int blockSide;   // 0xBF4
	Vec3i block;     // 0xBF8
	Vec3 rayHitVec;  // 0xC04
	Entity *entityPtr;
	Entity *entityPtr2;
	uint64_t GamingEntityFinder;

public:
	bool hasEntity();     // to not go trough the entity list twice
	Entity *getEntity();  // returns the entity that the player is looking at
	int getLevelTicks() {
		// return levelTicks;
		return *reinterpret_cast<int *>(reinterpret_cast<__int64>(this) + 0x8A0);
	}

	class LoopbackPacketSender *getLoopbackPacketSender() {
		return *reinterpret_cast<class LoopbackPacketSender **>(reinterpret_cast<__int64>(this) + 0xBD0);
	}

	void playSound(std::string sound, Vec3 const &position, float volume, float pitch) {
		using playSound_t = void(__fastcall *)(Level *, TextHolder *, Vec3 const &, float, float);
		static playSound_t func = reinterpret_cast<playSound_t>(Utils::getBase() + 0x2DD9860);  // 48 89 5C ? ? 48 89 6C ? ? 48 89 74 ? ? 57 48 83 EC ? 48 8B 41 ? 33 FF
		if (func != nullptr) func(this, &TextHolder(sound), position, volume, pitch);
	}

	// Credits to hacker hansen for this
	std::vector<Entity *> getMiscEntityList() { // 1.20 Vtable index: 304
		using entityList_t = std::int64_t *(__fastcall *)(Level *, void *);
		static entityList_t func = reinterpret_cast<entityList_t>(Utils::getBase() + 0x2E1CE60);  // 40 53 48 83 EC ? 48 81 C1 ? ? ? ? 48 8B DA E8 ? ? ? ? 48 8B C3 48 83 C4 ? 5B C3 CC CC 48 8B 81
		if (func != nullptr) {
			std::unique_ptr<char[]> alloc = std::make_unique<char[]>(0x18);
			std::int64_t *listStart = func(this, alloc.get());
			std::size_t listSize = ((*reinterpret_cast<std::int64_t *>(reinterpret_cast<std::int64_t>(listStart) + 0x8)) - (*listStart)) / 0x8;
			Entity **entityList = reinterpret_cast<Entity **>(*listStart);
			std::vector<Entity *> res;
			res.reserve(listSize);
			if (listSize > 0 && listSize < 5000) {
				for (std::size_t i = 0; i < listSize; i++) res.push_back(entityList[i]);
			}
			return res;
		}
		return {};
	}
};
class EntityRegistry;
struct EntityId {
	uint32_t id;
};
struct EntityContext {
	EntityRegistry *registry;
	EntityId id;
};

class Player;
class Dimension;
struct MobEffectInstance;
class Attribute;
class AttributeInstance;

class IPlayerMovementProxy {
public:
	virtual void Destructor();
	virtual __int64 _getStateProvider(void);
	virtual __int64 _getStateProvider2(void);
	virtual bool isRiding(void);
	virtual bool hasPassenger(void);
	virtual bool isClientside(void);
	virtual bool isCreative(void);
	virtual bool isInWater(void);
	virtual bool isOverScaffolding(void);
	virtual bool isSwimming(void);
	virtual bool isImmersedInWater(void);
	virtual bool isHeadInWater(void);
	virtual bool isSwimmer(void);
	virtual bool isImmobile(void);
	virtual bool isKnockedBackOnDeath(void);
	virtual bool shouldBeImmobile(void);
	virtual bool isControlledByLocalInstance(void);
	virtual bool hasTeleported(void);
	virtual bool isWearingLeatherBoots(void);
	virtual bool hasFamily(HashedString const &);
	virtual bool isWorldBuilder(void);
	virtual bool isSleeping(void);
	virtual bool usesOneWayCollision(void);
	virtual bool isStuckInCollider(void);
	virtual void setStuckInCollider(bool);
	virtual bool isStuckItem(void);
	virtual std::vector<AABB, std::allocator<AABB>> getOnewayPhysicsBlocks(void);
	virtual bool wasPenetratingLastFrame(void);
	virtual void setWasPenetratingLastFrame(bool);
	virtual bool isPrimaryLocalPlayer(void);
	virtual std::vector<AABB, std::allocator<AABB>> getSubAABBs(void);
	virtual void setSubAABBs(std::vector<AABB, std::allocator<AABB>> const &);
	virtual AABB getLiquidAABB(int);
	virtual bool isStackable(void);
	virtual void testForEntityStacking(AABB const &, std::vector<AABB, std::allocator<AABB>> &);
	virtual bool getCollidableActorNear(void);
	virtual void setCollidableActorNear(bool);
	virtual float getWalkDist(void);
	virtual void setWalkDist(float);
	virtual bool isFlying(void);
	virtual void setIsFlying(bool);
	virtual bool isOnGround(void);
	virtual void setOnGround(bool);
	virtual bool wasOnGround(void);
	virtual void setWasOnGround(bool);
	virtual int getHealth(void);
	virtual bool getHorizontalCollision(void);
	virtual void setHorizontalCollision(bool);
	virtual bool getVerticalCollision(void);
	virtual void setVerticalCollision(bool);
	virtual bool getCollision(void);
	virtual void setCollision(bool);
	virtual float getMaxAutoStep(void);
	virtual float getHeightOffset(void);
	virtual Vec3 getSlideOffset(void);
	virtual void setSlideOffset(Vec3 const &);
	virtual void setTerrainSurfaceOffset(float);
	virtual Vec3 getBlockMovementSlowdownMultiplier(void);
	virtual void setBlockMovementSlowdownMultiplier(BlockLegacy const &, Vec3 const &);
	virtual void resetBlockMovementSlowdownMultiplier(void);
	virtual float getCurrentSwimAmount(void);
	virtual AttributeInstance getAttribute(Attribute const &);
	virtual void hasEffect(__int64 const &);
	virtual int getEffect(__int64 const &);
	virtual int getActiveEffectCount(void);
	virtual __int64 _getEntityData(void);
	virtual void HashReset(void);
	virtual int getStatusFlag(int);
	virtual bool hasCategory(int);
	virtual bool isType(int);
	virtual int getEntityTypeId(void);
	virtual Vec3 getPos(void);
	virtual Vec3 getPosPrev(void);
	virtual void setPosDirect(Vec3 const &);
	virtual void setPos(Vec3 const &);
	virtual Vec3 getPosDeltaNonConst(void);
	virtual Vec3 getPosDeltaNonConst2(void);
	virtual void setAABB(AABB const &);
	virtual AABB getAABB(void);
	virtual Vec2 getAABBDim(void);
	virtual float getAttachPos(Vec3, float);
	virtual Vec2 getRot(void);
	virtual void setRot(Vec2 const &);
	virtual Vec2 getRotPrev(void);
	virtual float getFallDistance(void);
	virtual void setFallDistance(float);
	virtual bool isSneaking(void);
	virtual void setSneaking(bool);
	virtual float getHeadLookVector(float);
	virtual int getDimensionBlockSource(void);
	virtual int getRegionFromDimension(void);
	virtual __int64 fetchCollisionShapes(AABB const &, float *, bool, IPlayerMovementProxy *);
	virtual __int64 fetchEntities(IPlayerMovementProxy const *, AABB const &);
	virtual bool hasDimension(void);
	virtual __int64 getVehicle(void);
	virtual bool isWASDControlled(void);
	virtual int getControllingSeat(void);
	virtual int getPassengerIndex(IPlayerMovementProxy const &);
	virtual __int64 tryAsBoat(void);
	virtual void tryAsMob(void);
	virtual void tryAsMob1(void);
	virtual void tryAsPlayer(void);
	virtual void tryAsPlayer1(void);
	virtual int64_t getUniqueID(void);
	virtual int64_t getRuntimeID(void);
	virtual Vec3i getBlockPosCurrentlyStandingOn(IPlayerMovementProxy *, BlockSource const &);
	virtual Vec3i getBlockPosCurrentlyStandingOn(IPlayerMovementProxy *);
	virtual void shouldTriggerOnStandOn(BlockLegacy const &, Vec3i const &);
	virtual void _containsSneakCollisionShapes(AABB const &);
	virtual void move(Vec3 const &);
	virtual void moveBBs(Vec3 const &);
	virtual void checkFallDamage(float, bool);
	virtual void onBounceStarted(Vec3i const &, Block const &);
	virtual void updatePrevPosRot(void);
	virtual void sendActorMove(Vec3 const &);
	virtual void _teleportTo(Vec3 const &, bool, int, int);
	virtual void _getRawActor(void);
	virtual void _getRawActor2(void);
	virtual __int64 _getEntityData2(void);
	virtual void _setPreviousPosRot(void);
	virtual void _setHasTeleported(bool);
	virtual __int64 _getAttributes(void);
	virtual int _advanceLiveFrame(__int64 const &);
	virtual Entity* getEntity(void);
	virtual Entity* getEntity2(void);
	virtual int getNoJumpDelay(void);
	virtual void setNoJumpDelay(int);
	virtual bool isJumping(void);
	virtual void setJumping(bool);
	virtual bool getJumpVelRedux(void);
	virtual void setJumpVelRedux(bool);
	virtual Vec3 getJumpStartPos(void);
	virtual void setJumpStartPos(Vec3 const &);
	virtual float getJumpPower(void);
	virtual int getJumpTicks(void);
	virtual void setJumpTicks(int);
	virtual void _endJump(void);
	virtual void onPlayerJump(int);
	virtual float getSpeed(void);
	virtual void setSpeed(float);
	virtual bool isSprinting(void);
	virtual void setSprinting(bool);
	virtual bool isAllowedStandSliding(void);
	virtual void discardFriction(void);
	virtual float getTilt(void);
	virtual void setTilt(float);
	virtual void _allowAscendingScaffolding(void);
	virtual void ascendBlockByJumping(void);
	virtual void descendBlockByCrouching(void);
	virtual void ascendLadder(void);
	virtual void jumpFromGround(BlockSource const &);
	virtual void canAscendCurrentBlockByJumping(void);
	virtual void canDescendBlockBelowByCrouching(void);
	virtual bool isGliding(void);
	virtual Vec3 getVelocity(void);
	virtual void setVelocity(Vec3 const &);
	virtual float getActorRotation(void);
	virtual void setActorRotation(float);
	virtual void newServerAiStep(void);
	virtual void aiStep(void);
	virtual void updateAttackAnim(void);
	virtual int getNoActionTime(void);
	virtual void setNoActionTime(int);
	virtual float getYHeadRot(void);
	virtual void setYHeadRot(float);
	virtual float getSwimSpeedMultiplier(void);
	virtual void setSwimSpeedMultiplier(float);
	virtual void pushActors(void);
	virtual void updateGliding(void);
	virtual void travel(float, float, float, bool);
	virtual void playJumpSound(BlockSource const &);
	virtual void emitJumpPreventedEvent(Vec3i const &);
	virtual float getWaterWalkerEnchant(void);
	virtual float getFlySpeed(void);
	virtual void setFlySpeed(float);
	virtual void applyFinalFriction(float, bool);
	virtual float getFrictionModifier(void);
	virtual void setFrictionModifier(float);
	virtual void _getMob(void);
	virtual void _setYHeadRotOld(float);
	virtual bool isSlowedByItemUse(void);
	virtual int getItemUseMovementModifier(void);
	virtual void startGliding(void);
	virtual void stopGliding(void);
	virtual bool isSpectator(void);
	virtual bool isUsingItem(void);
	virtual bool isServerAuthoritativeMovement(void);
	virtual bool isAutoJumping(void);
	virtual void setAutoJumping(bool);
	virtual bool isAutoJumpEnabled(void);
	virtual void wasAutoJumping(void);
	virtual void setWasAutoJumping(bool);
	virtual bool isLocalPlayer(void);
	virtual int getSneakHeight(void);
	virtual float getBob(void);
	virtual void setBob(float);
	virtual float getLastBob(void);
	virtual void setLastBob(float);
	virtual void tryGetPlayerActionComponent(void);
	virtual int getCurrentTick(void);
	virtual int getClientInstance(void);
	virtual int getClientInstance1(void);
	virtual int getGlidingTicks(void);
	virtual int getVRMoveAdjustAngle(void);
	virtual int getPlayerPaddleForce(int);
	virtual void setPlayerPaddleForce(int, float);
	virtual bool isPaddling(int);
	virtual bool areHandsBusy(void);
	virtual void setHandsBusy(bool);
	virtual bool getAbilityBool(int);
	virtual void setAbilityBool(int, bool);
	virtual float getAbilityFloat(int);
	virtual void setAbilityFloat(int, float);
	virtual __int64 getAbilities(void);
	virtual void updateClientPlayerInputState(void);
	virtual bool isEmoting(void);
	virtual void setEmotingStatus(bool);
	virtual void fireEventPersonaEmotePlayed(bool);
	virtual void sendPacket(__int64 &);
	virtual void sendPacket2(__int64 &);
	virtual void sendRequestAbilityPacket(int, bool);
	virtual bool isArmorFlyEnabled(void);
	virtual void setJumpRidingScale(float);
	virtual int getJumpRidingScale(void);
	virtual void registerFramewiseActionOrStop(void);
	virtual int getLoadingState(void);
	virtual void setCurrentLocalMoveVelocity(Vec2 const &);
	virtual void setLastPos(Vec3 const &);
	virtual Vec3 getLastPos(void);
	virtual void setLastDelta(Vec3 const &);
	virtual __int64 getLastDelta(void);
	virtual void sendPlayerInput(void);
	virtual void sendInput(void);
	virtual void sendClientAuthInput(void);
	virtual void shouldSendPosition(void);
	virtual void sendPosition(void);
	virtual void checkMovementStats(Vec3 const &);
	virtual void sendPlayerMove(void);
	virtual void updateTouch(void);
	virtual void _getPlayer(void);
	virtual void _setPositionMode(int);
	virtual void _onMovePlayerPacketNormal(Vec3 const &, Vec2 const &, float);
	virtual void _resetPos(bool);
	virtual void _extractStateFromComponents(void);
	virtual void _applyStateToComponents(void);
	virtual int getControllingPlayer(void);
	virtual void setPaddleState(int, bool);
};

class EntityLocation {
public:
	Vec3 posPrev;
	Vec3 pos;
	Vec3 velocity;
};

class EntityRotation {
public:
	Vec2 rotPrev;
	Vec2 rot;
};

#pragma pack(push, 4)
class Entity {
public:
	EntityContext ctx;
private:
	char pad_0x10[0x128];  // 0x10
public:
	/*union {
		struct {
			float pitch;  // 0x0138
			float yaw;    // 0x013C
		};
		Vec2 viewAngles;
	};
	union {
		struct {
			float pitch2;  // 0x0138
			float yaw2;    // 0x013C
		};
		Vec2 viewAngles2;
	};*/
	char pad_128[0x10];

private:
	char pad_0148[16];  // 0x0148
public:
	// Vec3 eyePos0;  // 0x0158
	char pad_158[0xC];

private:
	char pad_0164[112];  // 0x0164
public:
	// float fallDistance;  // 0x01D4
	char pad_1D4[5];
	// bool onGround;       // 0x01D8
private:
	char pad_01D9[95];  // 0x01D9
public:
	// float stepHeight;  // 0x0238
	char pad_238[0x4];

private:
	char pad_023C[16];  // 0x023C
public:
	Vec3 slowdownFactor;  // 0x024C
private:
	char pad_0258[5];  // 0x0258
public:
	bool didEnterWaterBool;  // 0x025D
private:
	char pad_025E[1];  // 0x025E
public:
	bool hasEnteredWaterBool;  // 0x025F
private:
	char pad_0260[72];  // 0x0260
public:
	// int32_t ticksAlive;  // 0x02A8
	char pad_2A8[0x4];

private:
	char pad_02AC[172];  // 0x02AC
public:
	// class BlockSource *region;  // 0x0358
	char pad_0x358[8];

private:
	char pad_0360[8];  // 0x0360
public:
	// Level *level;  // 0x0368
	char pad_368[8];

private:
	char pad_0370[328];  // 0x0370
public:
	// AABB aabb;        // 0x04B8
	char pad_4B8[0x10];
	/*float width;  // 0x04D0
	float height;     // 0x04D4*/
	char pad_4D8[0x30];
	// Vec3 currentPos;  // 0x04D8
	// Vec3 oldPos;      // 0x04E4
	// Vec3 velocity;    // 0x04F0
	// Vec3 velocity2;   // 0x04FC
private:
	char pad_0508[80];  // 0x0508
public:
	// int64_t entityRuntimeId;  // 0x0558
	char pad_558[8];

private:
	char pad_0560[0x1C8];  // 0x0560
public:
	char pad_728[0x18];
	/*float bodyYaw;               // 0x0728
	float oldBodyYaw;                 // 0xtoolazytoupdatethesecommentsxd
	float yawUnused1;                 // 0x0748
	float yawUnused2;                 // 0x074C*/
	// int32_t damageTime;               // 0x0750
	// int32_t damageAnimationDuration;  // 0x0754
private:
	char pad_0758[136];  // 0x0758
public:
	// int32_t timeSinceDeath;  // 0x07E0
	char pad_7E0[8];

private:
	char pad_07E4[244];  // 0x07E4
public:
	class TextHolder playerName;  // 0x08D8
private:
	char pad_08F8[140];  // 0x08F8
public:
	bool canFly;  // 0x0984
private:
	char pad_0985[1667];  // 0x0985
public:
	int32_t ticksUsingItem;  // 0x1008
private:
	char pad_100C[20];  // 0x100C
public:
	int16_t itemData;  // 0x1020
	int16_t itemId;    // 0x1022
private:
	char pad_1024[508];  // 0x1024
public:
	// class InventoryTransactionManager transac;  // 0x1220

	BUILD_ACCESS(this, EntityContext, entityContext, 0x8);
	BUILD_ACCESS(this, uint32_t, entityIdentifier, 0x10);
	BUILD_ACCESS(this, int16_t, damageTime, 0x188);
	BUILD_ACCESS(this, int32_t, ticksAlive, 0x200);
	BUILD_ACCESS(this, Level *, level, 0x260);
	BUILD_ACCESS(this, EntityLocation *, location, 0x2A0);
	BUILD_ACCESS(this, AABB *, aabb, 0x2A8);
	BUILD_ACCESS(this, EntityRotation *, rotation, 0x2B0);
	BUILD_ACCESS(this, int64_t, timeSinceDeath, 0x62C);
	//BUILD_ACCESS(this, Vec3, eyePosPrev, 0x814);
	//BUILD_ACCESS(this, Vec3, eyePos, 0x820);
	BUILD_ACCESS(this, BlockSource *, region, 0xB98);
	BUILD_ACCESS(this, __int64 *, regionSharedPtr, 0xBA0);
	BUILD_ACCESS(this, InventoryTransactionManager, transac, 0xEC8);
	BUILD_ACCESS(this, TextHolder, playerName, 0x1D08);

	virtual int getStatusFlag(__int64);
	virtual void setStatusFlag(__int64, bool);
	virtual int getLastHurtByEntity(void);
